General-dev-all/Pati-Robot/firmware/sdkconfig.defaults
# Pati — derleme ayarlari
#
# Buradaki her satirin bir gerekcesi var. Gerekcesi olmayan ayar
# eklenmiyor: sonradan "bu neden boyle" diye bakildiginda cevabi
# olmayan ayar, guvenilmeyen ayardir.

# ---------------------------------------------------------------------------
# Hedef yonga
# ---------------------------------------------------------------------------
#
# 🔴 BURADA DURMASI SART. PLAN §7 bir ayar tutmadiginda "sdkconfig'i sil,
# bastan derle" diyor — dogru care, ama hedef yonga SADECE sdkconfig'de
# duruyordu. 31.07.2026'da tam bunu yaptim ve derleme gecti, yukleme
# "This chip is ESP32-S3, not ESP32" diye patladi: idf.py hedefi
# unutmustu.
#
# Burada olunca sdkconfig'i silmek zararsiz bir islem oluyor.
CONFIG_IDF_TARGET="esp32s3"

# ---------------------------------------------------------------------------
# PSRAM — 8 MB, oktal
# ---------------------------------------------------------------------------
# StickS3'un yongasi N8R8: 8 MB flash + 8 MB OKTAL PSRAM.
# PSRAM sart cunku WebSocket'in TLS tamponlari ve ses kuyruklari dahili
# 512 KB SRAM'e sigmiyor. stackchan'in conversation bileseni de
# tamponlarini PSRAM'den aliyor (psram_allocator.hpp).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
# ---------------------------------------------------------------------------
# 🔴 PSRAM 40 MHz — 80 MHz sarsintiya dayanmiyor
# ---------------------------------------------------------------------------
#
# 01.09.2026, IKI KARTTA DA olculdu. Cihaz konusurken elle sallandiginda
# yeniden basliyordu. Seri gunlukten iki ayri sifirlama sebebi cikti:
#
#   rst:0x3 (RTC_SW_SYS_RST)   PC -> rtc_brownout_isr_handler
#   rst:0x8 (TG1WDT_SYS_RST)   PC -> panic_enable_cache
#
# Ikincisi anahtar. Panic isleyicisi CALISMIS ama onbellegi yeniden
# acarken DONMUS; yani flash/PSRAM veri yolu cevap vermiyor. Isleyici
# bile kurtaramayinca donanim bekcisi karti sifirliyor — bu yuzden hicbir
# backtrace goremedik, CPU kod calistirmiyor, veri yolunda bekliyor.
#
# MEKANIZMA: sarsinti beslemede kisa bir dalgalanma yapiyor. Derin olursa
# brownout dedektoru yakaliyor (birinci sebep). Sig olursa dedektor
# gormuyor, ama 80 MHz'lik oktal PSRAM o dalgalanmayi kaldiramayip veri
# yolunu kilitliyor.
#
# 40 MHz zamanlama payini iki katina cikariyor. Bedeli PSRAM bant
# genisliginin yarilanmasi; olculen tur gecikmesi 2-30 ms ve butce cok
# daha genis, yani yeri var.
#
# ✅ FLASH DA 40 MHz'E INDI (02.09.2026, asagida). Bu not oraya
# gonderiyordu ve sira gercekten geldi.
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_USE_MALLOC=y

# ---------------------------------------------------------------------------
# 🔴 DAHILI SRAM'I PSRAM'E BOSALT — olculdu, tahmin degil
# ---------------------------------------------------------------------------
#
# 01.09.2026, gercek kartta, acilistan 65 saniye sonra:
#
#     bos yigit: 27447 bayt
#     dahili SRAM: en dusuk 1903 · en buyuk blok 7680 bayt
#
# Yani dahili SRAM TAMAMEN TUKENMENIN 2 KB UZAGINA kadar indi. Sonucu
# seri gunlukte goruldu:
#
#     E Dynamic Impl: alloc(4437 bytes) failed
#     E esp-tls-mbedtls: write error :-0x7F00
#     E websocket_client: ESP_ERR_MBEDTLS_SSL_WRITE_FAILED
#
# mbedtls TLS yazmasi icin yer bulamiyor, baglanti kopuyor, tur
# acilmiyor. DISARIDAN GORUNUSU: "Pati cevap vermiyor, bir sure sonra
# kendine geliyor" — ve sebebi bellekte aranmiyor, agda ya da
# donanimda araniyor. Bir kere de cihazi sallamakla karistirildi.
#
# 8 MB PSRAM ise bos duruyor. Iki ayar onu kullandiriyor:
#
# TRY_ALLOCATE_WIFI_LWIP: wifi ve lwIP tamponlari once PSRAM'den
# isteniyor. Bu tamponlar dahili SRAM'in en buyuk musterisi ve DMA
# gerektirmiyorlar.
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ALWAYSINTERNAL: bu boyutun ALTINDAKI ayirmalar her zaman dahili
# SRAM'den yapiliyor. 16384 idi, yani 4437 baytlik TLS tamponu da dahili
# isteniyordu — tam basarisiz olan istek. 4096'ya indirildi: kucuk ve
# sik ayirmalar (gorev yapilari, kuyruklar) dahili kaliyor, TLS ve
# websocket gibi buyuk tamponlar PSRAM'e gidiyor.
#
# ⚠️ SIFIRA INDIRILMIYOR. PSRAM erisimi dahili SRAM'den yavas; her
# kucuk ayirmayi oraya atmak ses ve goz butcelerini yerdi.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# ---------------------------------------------------------------------------
# Flash — 8 MB (StickS3: ESP32-S3-PICO-1-N8R8)
# ---------------------------------------------------------------------------
#
# ⚠️ BURAYI DEGISTIRMEK YETMIYOR. Yerel `sdkconfig` zaten varsa bu dosya
# OKUNMAZ — sdkconfig.defaults yalnizca sdkconfig HENUZ YOKKEN
# uygulaniyor. Degisiklikten sonra `idf.py reconfigure` sart.
#
# 23.08.2026'da tam bu tuzaga dusuldu: PATI_EKRAN_VAR'in varsayilani
# degistirildi, kart yeniden derlendi, olcum alindi ve olcum ANLAMSIZDI
# — eski sdkconfig hala yururlukteydi. CI'da boyle bir sorun yok cunku
# temiz bir kopyada derliyor ve sdkconfig hic olusmamis oluyor.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# ---------------------------------------------------------------------------
# Flash 40 MHz — PSRAM'den sonra sirasi gelen ikinci saat
# ---------------------------------------------------------------------------
#
# PSRAM 80 -> 40 MHz indirilmisti (sallayinca cokme, TESHIS.md) ve o
# zaman yukariya su not dusulmustu: "Flash da 80 MHz. Sallama hala
# coktururse bir sonraki deneme orayi 40 MHz'e indirmek."
#
# 02.09.2026'da sira geldi — ama sallama yuzunden degil. Pilde brownout
# suruyor ve o gun brownout esiginin ZATEN en toleransli ayarda oldugu
# dogrulandi (ESP32-S3 LVL_SEL_7 = 2,44 V, kaynak esp-idf
# components/esp_hw_support/power_supply/port/esp32s3/Kconfig.power).
# Yani 3,3 V rayi gercekten 2,44 V'a dusuyor; yuksek frekansli flash
# erisimi hem akim cekiyor hem de gerilim dustugunde ilk bozulan yer.
#
# Bedeli kod okumanin yavaslamasi. Onbellek sayesinde pratikte kucuk
# olmali; olculecek olan goz kare suresi (TESHIS.md'de 24-30 ms).
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y

# ---------------------------------------------------------------------------
# Bolum tablosu — OTA'li
# ---------------------------------------------------------------------------
#
# 🔴 BU AYAR KABLOYLA YUKLENMEK ZORUNDA. Bolum tablosunu OTA degistiremiyor:
# OTA yalnizca uygulama bolumune yaziyor, tabloya dokunmuyor. Pati govdeye
# girip cocuga gittikten SONRA burasi degistirilemez — kutuyu acmak gerekir.
#
# Gerekcelerin tamami partitions.csv'nin basinda.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---------------------------------------------------------------------------
# OTA geri alma — bozuk guncelleme robotu tuglaya cevirmesin
# ---------------------------------------------------------------------------
#
# Pati baskasinin evinde, cocugun odasinda duracak. Bozuk bir yapi
# yuklenirse oraya gidip USB takmak yok.
#
# Bu ayar acikken yeni yapi "denemede" (PENDING_VERIFY) aciliyor. Uygulama
# `esp_ota_mark_app_valid_cancel_rollback()` diyene kadar gecici sayiliyor;
# demeden once yeniden baslarsa onyukleyici ESKI yapiya donuyor.
#
# Pati bunu panel ayaga kalkinca soyluyor (app_main). Gerekcesi orada.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Indirme HTTPS'ten. Duz HTTP'ye asla izin verilmiyor: guncelleme dosyasi
# robotun UZERINDE CALISACAK kod ve araya girilebilir bir kanaldan
# gelmemeli.
# CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP is not set

# ---------------------------------------------------------------------------
# Derleyici optimizasyonu — HIZ
# ---------------------------------------------------------------------------
#
# 🔴 31.07.2026, GERCEK KARTTA OLCULDU. Bu satir eksikti ve ESP-IDF'in
# varsayilani devreye giriyordu: CONFIG_COMPILER_OPTIMIZATION_DEBUG,
# yani `-Og`. Butun Pati firmware'i bugune kadar HATA AYIKLAMA kipinde
# derlendi.
#
# Fark eden sey: gozlerin bir karesi 49 ms surdu (butce 33 ms) ve
# harmanlanan piksel basina 250 islemci cevrimi cikti — yapilan is
# bunun bes katindan azdi. Once yuvarlama, sonra satir ici acilma
# denendi; ikisi de sadece birkac milisaniye kazandirdi. Sebep tek bir
# fonksiyon degil, kodun TAMAMININ optimize edilmemis olmasiymis.
#
# Kimse fark etmemisti cunku bugune kadar hicbir sey GERCEK KARTTA
# olculmemisti. PC testleri MSVC ile /O2 derleniyor, yani oradan
# gorunmuyor.
#
# ⚠️ Yaniltici ipucu: derleme ciktisinda "-- USING O3" yaziyor. O bizim
# degil — espressif__esp_audio_codec bileseni kendi kodu icin basiyor.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# ---------------------------------------------------------------------------
# CPU 160 MHz — 240'a cikarilmisti, 11.09.2026'da geri indirildi
# ---------------------------------------------------------------------------
#
# 🔴 240'IN GEREKCESI DUSTU. Gerekce soyleydi ve gercek kartta olculmustu
# (01.09.2026): goz cizici kare basina 45-49 ms harciyordu ve BUTCE
# 50 ms'ti (20 fps). Bes saniyede ~90 kare atlaniyordu.
#
# O butce artik 50 ms degil, 100 ms — 3.5.4'te pil/sarj profil ayrimi
# kalkti ve gozler her kaynakta 10 fps'e indi (konusurken 5).
# 45-49 ms, 100 ms'lik butceye rahat siginiyor.
#
# Ustelik cizim o gunden beri ucuzladi: 11.09.2026 acilis kaydinda
# 240 MHz'de kare 13,5 ms (butce 50 ms, atlanan 0). 160 MHz'de
# kabaca 20 ms eder ve 100 ms'lik butcenin besde biri.
#
# ⚠️ 240 baska seyleri de hizlandiriyordu: ses yeniden ornekleme, TLS,
# websocket. Yeniden ornekleyici icin risk yok — cikis basina birkac
# float islemi, 48 kHz'de bir cekirdegin binde birkacu. TLS ve
# websocket yavaslar; ESP32-S3'un IDF varsayilani zaten 160 ve bu
# yaygin bir calisma noktasi.
#
# 🔴 SESTE BOZULMA OLURSA ILK SUPHELI BURASI. Pati'nin sesi
# kullanicinin tek pazarliksiz sarti (CLAUDE.md). Geri almak icin bu
# satiri _240 yapip sdkconfig'i SILMEK yeterli — dosya varken
# defaults okunmuyor.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y


# ---------------------------------------------------------------------------
# C++20
# ---------------------------------------------------------------------------
# stackchan'in conversation bileseni C++20 istiyor (CMakeLists'inde
# cxx_std_20 yazili). tl::expected ve std::span kullaniyor.
CONFIG_COMPILER_CXX_EXCEPTIONS=y

# ---------------------------------------------------------------------------
# TLS
# ---------------------------------------------------------------------------
# Gemini Live wss:// uzerinden. Sertifika dogrulamasi ACIK kaliyor —
# cocugun sesini tasiyan bir baglantida bunu kapatmak kabul edilemez.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# TLS el sikisma tamponu. AGENTS.md/PLAN §5: "TLS tek gercek yuk."
# Varsayilan 16 KB yetiyor ama PSRAM'den alinsin ki dahili SRAM bosalsin.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y

# ---------------------------------------------------------------------------
# 🔴 mbedTLS TAMAMEN PSRAM'DEN — parcalanma dahili SRAM'i yiyordu
# ---------------------------------------------------------------------------
#
# Yukaridaki DYNAMIC_BUFFER "PSRAM'den alinsin" DIYORDU ama almiyordu:
# o ayar tamponlari kullanilmadiginda serbest birakiyor, NEREDEN
# alindigini degistirmiyor. Ayirmalar yine genel yigittan, yani once
# dahili SRAM'den yapiliyordu.
#
# 01.09.2026, gercek kartta olculdu. Once dahili SRAM tamamen tukendi
# (dip nokta 1903 bayt) ve TLS yazmasi coktu:
#
#     E Dynamic Impl: alloc(4437 bytes) failed
#
# Wifi/lwIP tamponlari PSRAM'e alininca dip nokta 30475'e cikti. Ama
# ARDINDAN, dokuz dakika ve yedi yeniden baglanma sonra:
#
#     dahili SRAM: en dusuk 2611 · en buyuk blok 10240 bayt
#
# Bos alan 45 KB'ken en buyuk ardisik blok 10 KB. Yani sorun yer degil,
# PARCALANMA: her TLS oturumu aciliyor, kapaniyor ve arkasinda delik
# birakiyor. Zayif wifi yuzunden dakikada bir yeniden baglanan bir
# cihazda bu birikiyor ve sonunda 4 KB'lik bir istek bile karsilanamaz
# hale geliyor.
#
# Bu ayar mbedTLS'in ayirmalarini dogrudan PSRAM'e yonlendiriyor.
# Parcalanma orada oluyor ve 8 MB icinde onemsiz kaliyor; dahili SRAM
# DMA'ya, kesmelere ve gorev yigitlarina kaliyor.
#
# BEDELI: TLS islemleri PSRAM'den biraz yavas. Kabul edilebilir —
# olculen tur gecikmesi zaten 2-30 ms ve butce cok daha genis.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# ---------------------------------------------------------------------------
# Gorev yigitlari ve zamanlayici
# ---------------------------------------------------------------------------
# esp_timer'i olcum icin kullaniyoruz (mikrosaniye damgasi). stackchan'in
# ConversationEvent'i de emit_us alaninda ayni saati veriyor.
CONFIG_ESP_TIMER_TASK_STACK_SIZE=4096

# WebSocket ve ses gorevleri ayni cekirdekte bogusmasin.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ---------------------------------------------------------------------------
# Soket sayisi — captive portal bunu tuketiyordu
# ---------------------------------------------------------------------------
#
# 🔴 31.07.2026, gercek cihazda logdan gorildi:
#     E httpd: httpd_accept_conn: error in accept (23)
#     W httpd: httpd_server: error accepting new connection
# errno 23 = ENFILE, yani sistemde bos soket kalmamis.
#
# Varsayilan 10 idi ve kurulum modunda su anda ayni anda kullaniliyor:
# httpd dinleyicisi + denetim soketi + 7 acik baglanti + DNS sunucusu
# (captive portal). Tarayici sayfayi acarken alti dosyayi paralel
# cekiyor, ustune telefonun isletim sistemi "internet var mi" diye
# saniyede bir yoklama atiyor. Sinir tam burada doluyor.
#
# Sonucu ebeveyn su sekilde goruyordu: panel iki saniyede bir
# "baglanti koptu" deyip kendine geliyor, sayfa zipliyor ve
# gezilemiyor hale geliyordu.
CONFIG_LWIP_MAX_SOCKETS=16

# ---------------------------------------------------------------------------
# Kayit
# ---------------------------------------------------------------------------
# Asama 2'nin tek isi olcum; olculen sayilar seri porttan okunacak.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
